MicrochipTech/dspic33a-high-speed-adc-example/cli.c
void console_flush(void)
{
    console_drain();
}

/* Bring the console back up from scratch, assuming nothing about the
 * current state of the pins, the PPS mapping or the UART.
 *
 * This is what _DefaultInterrupt() calls before it reports a trap. A trap
 * can have happened anywhere, including inside clock_init() or after some
 * other code disturbed the peripheral, and in that situation
 * console_sync_baud() is not enough: it only fixes the baud divider, and
 * it trusts clock.c to say what the clock is. Here the routing is written
 * again and the baud rate is picked from the clock the CPU is actually
 * on, so the one message that explains the fault has the best chance of
 * getting out.
 *
 * Safe to call when the console is already up - it re-writes the same
 * values - and safe from interrupt context: no waiting except the bounded
 * drain. */
void console_force_up(void)
{
    console_drain();                   /* bounded; keep a partial line    */

    CONSOLE_TX_TRIS  = 0u;
    CONSOLE_RX_TRIS  = 1u;
    RPCONbits.IOLOCK = 0u;
    CONSOLE_RX_RPINR = CONSOLE_RX_RP;
    CONSOLE_TX_RPOR  = CONSOLE_TX_FN;
    RPCONbits.IOLOCK = 1u;

    uart2_setup(clock_cpu_on_pll() ? UART_BRG_PLL : UART_BRG_FRC);
}

/* Make the baud generator match whatever clock the CPU is on right now.
 * fail() calls this first: a failure after the switch to PLL2 but before
 * cli_init() would otherwise print at the wrong rate. */
void console_sync_baud(void)
{
    const uint32_t want = clock_cpu_on_pll() ? UART_BRG_PLL : UART_BRG_FRC;
    if (U2BRG != want) {
        console_drain();
        uart2_setup(want);
    }
}

/* Output sink for the parser: take what fits into the transmit FIFO and
 * report how much that was. The parser re-offers the rest (see
 * cmd_parser.h, "Flow control"). */
static size_t console_write(const char *data, size_t len)
{
    size_t n = 0;
    while ((n < len) && !U2STATbits.TXBF) {
        U2TXB = (uint8_t)data[n++];
    }
    return n;
}

/* Called by the parser while the transmit FIFO is full. Nothing to yield
 * to on a bare-metal build, but this is the moment to look for Ctrl+C:
 * a long reply must be abortable, and while it drains the receive
 * interrupt cannot run (we are inside it). Other bytes typed during a
 * reply are dropped. */
static void console_yield(void)
{
#ifdef __MPLAB_DEBUGGER_SIMULATOR
    return;     /* the simulator has no UART receiver: RXBE never rises */
#endif
    while (!U2STATbits.RXBE) {
        if ((uint8_t)U2RXB == 0x03u) {
            cmd_parser_abort();
        }
    }
}

/* Receive diagnostics, shown in the [stat] line and by "status": how many
 * bytes the interrupt took from the UART, the last one, and how many
 * CR / LF among them. "I type and nothing happens" is then one of three
 * things: rx stays 0 (nothing reaches RD1, the echo was the terminal's),
 * rx counts but cr stays 0 (the terminal sends LF only - the parser ends
 * a line on CR), or cr counts and still no reply (the parser or the
 * transmit path). */
static volatile uint32_t rx_count = 0;
static volatile uint32_t rx_cr    = 0;
static volatile uint32_t rx_lf    = 0;
static volatile uint8_t  rx_last  = 0;

/* The parser thread: every received byte goes to the line editor, and
 * a completed line is dispatched right here, in interrupt context. */
void __attribute__((interrupt, no_auto_psv)) _U2RXInterrupt(void)
{
    IFS3bits.U2RXIF = 0u;             /* first: a byte arriving meanwhile re-raises it */
    while (!U2STATbits.RXBE) {
        const uint8_t b = (uint8_t)U2RXB;
        rx_count++;
        rx_last = b;
        if (b == 0x0Du)      { rx_cr++; }
        else if (b == 0x0Au) { rx_lf++; }
        cmd_parser_feed_char((char)b);
    }
}

/* ------------------------------------------------------------------ *
 * Small formatting helpers - no printf, so the reply cost is predictable
 * ------------------------------------------------------------------ */
static char *u32_to_str(char *out, uint32_t v)
{
    char tmp[11];
    int i = 0;
    do { tmp[i++] = (char)('0' + (v % 10u)); v /= 10u; } while (v != 0u);
    while (i > 0) { *out++ = tmp[--i]; }
    *out = '\0';
    return out;
}

static char *u32_to_hex(char *out, uint32_t v)
{
    static const char digits[] = "0123456789ABCDEF";
    *out++ = '0'; *out++ = 'x';
    for (int shift = 28; shift >= 0; shift -= 4) {
        *out++ = digits[(v >> shift) & 0xFu];
    }
    *out = '\0';
    return out;
}

static char *copy_str(char *out, const char *s)
{
    while (*s) { *out++ = *s++; }
    *out = '\0';
    return out;
}

/* "key: value" lines.
 *
 * The key is NOT copied into the line buffer. It used to be, into a
 * char[48], and two callers overflowed it: the self-test's
 * "[selftest] mean on internal 15/16 VDD (expect ~3840)" is 52
 * characters, so with the value and CRLF it wrote 67 bytes into 48 - a
 * stack overrun on the *success* path, which would have corrupted the
 * return address at the exact moment the board reported that everything
 * worked. Printing the key straight out and formatting only the number
 * removes the failure mode instead of enlarging the buffer: the value is
 * at most 10 digits or 10 hex characters, so 16 bytes is provably enough
 * no matter how long a key some later caller passes.
 *
 * The console_* variants go out blocking through console_puts() (trace,
 * fail, trap, dump); put_kv() goes through the parser and is for command
 * replies. */
void console_kv(const char *key, uint32_t v)
{
    char num[16];
    char *p = u32_to_str(num, v);
    copy_str(p, "\r\n");
    console_puts(key);
    console_puts(": ");
    console_puts(num);
}

void console_kv_hex(const char *key, uint32_t v)
{
    char num[16];
    char *p = u32_to_hex(num, v);
    copy_str(p, "\r\n");
    console_puts(key);
    console_puts(": ");
    console_puts(num);
}

void console_regs_dump(void)
{
    console_puts("[regs] uart\r\n");
    console_kv_hex("IEC3", IEC3);           /* U2RX enable,  bit 6       */
    console_kv_hex("IFS3", IFS3);           /* U2RX flag,    bit 6       */
    console_kv_hex("IPC12", IPC12);         /* U2RX priority, bits 26:24 */
    console_kv_hex("U2CON", U2CON);
    console_kv_hex("U2STAT", U2STAT);
    console_kv_hex("U2BRG", U2BRG);
    /* Pin routing of the console itself: with a silent terminal these say
     * whether console_early_init() took effect. Expected: IOLOCK set, the
     * TX pin's byte in its RPOR word = 21 = 0x15 (U2TX), U2RXR (bits 23:16
     * of RPINR13) = the RX pin's remap number (board.h: 50 = 0x32 on the
     * EV74H48A, 44 = 0x2C on the Nano), the TX pin's TRIS bit clear, the
     * RX pin's TRIS bit set. */
    console_kv_hex("RPCON", RPCON);
    console_kv_hex("RPORn (TX pin's word)", CONSOLE_TX_RPOR_WORD);
    console_kv_hex("RPINRn (U2RXR's word)", CONSOLE_RX_RPINR_WORD);
    console_kv_hex("TRISx (TX pin's port)", CONSOLE_TX_TRIS_WORD);
    console_kv_hex("TRISx (RX pin's port)", CONSOLE_RX_TRIS_WORD);
}

#if BOOT_VERBOSE
void console_trace(const char *s)                    { console_puts(s); }
void console_trace_kv(const char *key, uint32_t v)   { console_kv(key, v); }
void console_trace_kv_hex(const char *key, uint32_t v) { console_kv_hex(key, v); }
#else
void console_trace(const char *s)                    { (void)s; }
void console_trace_kv(const char *key, uint32_t v)   { (void)key; (void)v; }
void console_trace_kv_hex(const char *key, uint32_t v) { (void)key; (void)v; }
#endif

