MicrochipTech/dspic33a-high-speed-adc-example/cli.c
/* The CLKGEN6 divide ratios, for "test clock" only: this is the knob
 * that writes and reads back correctly and does not change the rate
 * (HARDWARE-LOG runs 8 and 9). The rate ladder lives in capture.c and is
 * made of PLL settings. Ratios between 100 and 200 are left out - FRACDIV
 * does nothing while INTDIV is 0, so they cannot be realised. */
static const uint32_t clkdiv_ratios[] = {
    1000u, 900u, 800u, 700u, 600u, 500u, 450u, 400u, 350u, 300u, 250u, 200u, 100u
};

static bool test_clock(void)
{
    const uint32_t count  = sizeof clkdiv_ratios / sizeof clkdiv_ratios[0];
    const uint32_t *ratios = clkdiv_ratios;
    uint32_t bad = 0u;
    console_puts("[test] clock: switch every divide ratio and read it back - no measurement\r\n"
                 "[test]   order per ratio: DMA down, ADC core off, CLKGEN6 off, divider\r\n"
                 "[test]   written and read back, generator on, DIVSWEN, CLKRDY, core on\r\n");
    for (uint32_t i = 0; i < count; i++) {
        const uint32_t rc   = capture_set_clkdiv(ratios[i]);
        const uint32_t back = capture_clkdiv();
        /* Longest line: ratio and read-back (4 digits each), the clock in
         * Hz (9 digits) and the longest error text (about 50), well
         * inside 160. */
        char line[160];
        char *q = copy_str(line, "[test]   ratio ");  q = u32_to_str(q, ratios[i]);
        q = copy_str(q, " -> read back ");            q = u32_to_str(q, back);
        q = copy_str(q, ", adc clock Hz ");           q = u32_to_str(q, clock_adc_hz());
        q = copy_str(q, ", ");                        q = copy_str(q, clock_adc_div_error(rc));
        if ((rc == CLKDIV_OK) && (back != ratios[i])) {
            q = copy_str(q, " - BUT THE READBACK DIFFERS");
        }
        copy_str(q, "\r\n");
        console_puts(line);
        if ((rc != CLKDIV_OK) || (back != ratios[i])) { bad++; }
    }
    (void)capture_set_clkdiv(ADC_CLKDIV);
    console_kv("[test]   ratios that did not arrive", bad);
    console_puts("[test]   NOTE: this only proves the register holds the value. Runs 8 and 9\r\n"
                 "[test]   passed here and the rate did not follow at any ratio - the rate\r\n"
                 "[test]   is set with the PLL now (test sweep, pll command).\r\n");
    console_puts((bad == 0u) ? "[test] clock: PASS\r\n" : "[test] clock: FAIL\r\n");
    return bad == 0u;
}

static bool test_clkoff(void)
{
    /* Is CLKGEN6 the ADC's clock at all? Table 16-1 says so, and the
     * generator's divider has no effect on the rate - so ask the board. */
    console_puts("[test] clkoff: switch CLKGEN6 off and try to convert anyway\r\n"
                 "[test]   Table 16-1 names CLKGEN6 as the ADC clock, but its divider\r\n"
                 "[test]   changes nothing. If halves still arrive with the generator\r\n"
                 "[test]   off, the ADC is not running off it and that explains it all.\r\n");
    const uint32_t rc = capture_clkoff_probe(8u);
    console_kv("[clkoff]   halves after the generator was switched off", blocks_done);
    if (rc == 0u) {
        console_puts("[test] clkoff: THE ADC KEPT CONVERTING WITH CLKGEN6 OFF\r\n"
                     "[test]   -> CLKGEN6 is not (only) the ADC clock; the rate must come\r\n"
                     "[test]      from somewhere else. This is the finding, not a failure.\r\n");
        return false;
    }
    console_puts("[test] clkoff: no data with the generator off - CLKGEN6 does feed the ADC\r\n");
    return true;
}

static bool test_rate(uint32_t halves)
{
    uint32_t ksps = 0u;
    const uint32_t ratio   = capture_clkdiv();
    const uint32_t nominal = capture_nominal_ksps(ratio);
    console_puts("[test] rate: delivered rate at the ratio set now\r\n");
    console_kv("[test]   ratio", ratio);
    console_kv("[test]   ksps nominal", nominal);
    const uint32_t rc = capture_measure_rate(halves, &ksps);
    if (rc != 0u) {
        console_puts("[test]   no data\r\n[test] rate: FAIL\r\n");
        return false;
    }
    console_kv("[test]   ksps measured", ksps);
    console_kv("[test]   overrun during the measurement", dma_overrun);
    /* 10 % is the window the old rate test used; the rate comes from a
     * divided clock, so anything outside it means the divider is not
     * doing what the register says. */
    const uint32_t diff = (ksps > nominal) ? (ksps - nominal) : (nominal - ksps);
    const bool ok = (nominal != 0u) && (diff <= (nominal / 10u));
    console_puts(ok ? "[test] rate: PASS\r\n"
                    : "[test] rate: FAIL - the delivered rate does not follow the ratio\r\n");
    return ok;
}

static bool test_sweep(uint32_t halves)
{
    console_puts("[test] sweep: the ladder from the slowest rate up\r\n");
    console_sweep(halves, false);
    console_puts("[test] sweep: done - read the table, there is no single verdict\r\n");
    return true;
}

static bool test_dac(uint32_t halves)
{
    console_puts("[test] dac: the DAC2 triangle through ADC, DMA and the ping-pong buffer\r\n");
    if (!dac_running(2u) && !dac_triangle_start(2u, 0x100u, 0xF00u, 8u)) {
        console_puts("[test]   CLKGEN7 did not come up - DAC2 is off\r\n[test] dac: FAIL\r\n");
        return false;
    }
    const uint32_t rc = run_dactest(halves);
    console_puts((rc == 0u) ? "[test] dac: PASS\r\n" : "[test] dac: FAIL\r\n");
    return rc == 0u;
}

static void test_list(void)
{
    put_line("test all   [halves]  - self, clock, sweep, dac in that order");
    put_line("test self            - ADC -> DMA -> RAM on the internal reference");
    put_line("test clock           - switch every CLKGEN6 ratio and read it back");
    put_line("test clkoff          - switch CLKGEN6 off: does the ADC still convert?");
    put_line("test rate  [halves]  - delivered rate at the ratio set now");
    put_line("test sweep [halves]  - the rate ladder, slowest first, with the counters");
    put_line("test dac   [halves]  - the DAC2 triangle: is everything there, in order?");
    put_line("pll <p1> <p2> sets the rate by hand; clk sets the (ineffective) CLKGEN6");
    put_line("ratio; regs prints the registers");
}

static void cmd_test_fn(int argc, char **argv)
{
    uint32_t halves = 0u;                  /* 0 = the part's own default */
    if (argc == 1) { test_list(); return; }
    if (argc > 3) { usage("test <all|self|clock|clkoff|rate|sweep|dac> [halves]"); return; }
    if ((argc == 3) && !arg_u32(argv[2], 1u, 100000u, &halves)) {
        usage("test <all|self|clock|clkoff|rate|sweep|dac> [halves]");
        return;
    }
    const char *what = argv[1];

    if (strcmp(what, "self") == 0) {
        if (!test_self()) { cmd_parser_fail(); }
    } else if (strcmp(what, "clock") == 0) {
        if (!test_clock()) { cmd_parser_fail(); }
    } else if (strcmp(what, "clkoff") == 0) {
        if (!test_clkoff()) { cmd_parser_fail(); }
    } else if (strcmp(what, "rate") == 0) {
        if (!test_rate((halves != 0u) ? halves : TEST_RATE_HALVES)) { cmd_parser_fail(); }
    } else if (strcmp(what, "sweep") == 0) {
        (void)test_sweep((halves != 0u) ? halves : TEST_SWEEP_HALVES);
    } else if (strcmp(what, "dac") == 0) {
        if (!test_dac((halves != 0u) ? halves : TEST_DAC_HALVES)) { cmd_parser_fail(); }
    } else if (strcmp(what, "all") == 0) {
        console_puts("\r\n[test] ALL - self, clock, sweep, dac\r\n");
        (void)capture_set_clkdiv(ADC_CLKDIV);      /* start slow          */
        const bool self_ok = test_self();
        if (!self_ok) {
            /* The only part whose failure stops the rest: without a
             * working chain every number after it is meaningless. */
            console_puts("[test] ALL: STOPPED - the chain itself does not work\r\n");
            cmd_parser_fail();
            return;
        }
        const bool clock_ok = test_clock();
        (void)test_clkoff();
        (void)test_sweep((halves != 0u) ? halves : TEST_SWEEP_HALVES);
        const bool dac_ok = test_dac(TEST_DAC_HALVES);
        console_puts("\r\n[test] ALL DONE\r\n");
        console_puts(self_ok  ? "[test]   self:  PASS\r\n" : "[test]   self:  FAIL\r\n");
        console_puts(clock_ok ? "[test]   clock: PASS\r\n" : "[test]   clock: FAIL\r\n");
        console_puts("[test]   sweep: see the table above\r\n");
        console_puts(dac_ok   ? "[test]   dac:   PASS\r\n" : "[test]   dac:   FAIL\r\n");
        if (!clock_ok || !dac_ok) { cmd_parser_fail(); }
    } else {
        test_list();
        cmd_parser_fail();
    }
}
CMD_DEFINE(test, "test", cmd_test_fn, "test [all|self|clock|clkoff|rate|sweep|dac] [halves]");

